In [1]:
import pandas as pd
medals=pd.read_csv('K:\TensorflowPY36CPU\TensorflowPY36CPU\_1_PythonBasic\Data\Data\Summer Olympic medallists 1896 to 2008 - ALL MEDALISTS .csv',skiprows=4 )

In [2]:
medals.shape

(29216, 10)

In [3]:
medals.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>City</th>
      <th>Edition</th>
      <th>Sport</th>
      <th>Discipline</th>
      <th>Athlete</th>
      <th>NOC</th>
      <th>Gender</th>
      <th>Event</th>
      <th>Event_gender</th>
      <th>Medal</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Athens</td>
      <td>1896</td>
      <td>Aquatics</td>
      <td>Swimming</td>
      <td>HAJOS, Alfred</td>
      <td>HUN</td>
      <td>Men</td>
      <td>100m freestyle</td>
      <td>M</td>
      <td>Gold</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Athens</td>
      <td>1896</td>
      <td>Aquatics</td>
      <td>Swimming</td>
      <td>HERSCHMANN, Otto</td>
      <td>AUT</td>
      <td>Men</td>
      <td>100m freestyle</td>
      <td>M</td>
      <td>Silver</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Athens</td>
      <td>1896</td>
      <td>Aquatics</td>
      <td>Swimming</td>
      <td>DRIVAS, Dimitrios</td>
      <td>GRE</td>
      <td>Men</td>
      <td>100m freestyle for sailors</td>
      <td>M</td>
      <td>Bronze</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Athens</td>
      <td>1896</td>
      <td>Aquatics</td>
      <td>Swimming</td>
      <td>MALOKINIS, Ioannis</td>
      <td>GRE</td>
      <td>Men</td>
      <td>100m freestyle for sailors</td>
      <td>M</td>
      <td>Gold</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Athens</td>
      <td>1896</td>
      <td>Aquatics</td>
      <td>Swimming</td>
      <td>CHASAPIS, Spiridon</td>
      <td>GRE</td>
      <td>Men</td>
      <td>100m freestyle for sailors</td>
      <td>M</td>
      <td>Silver</td>
    </tr>
  </tbody>
</table>
</div>

In [4]:
medals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29216 entries, 0 to 29215
Data columns (total 10 columns):
City            29216 non-null object
Edition         29216 non-null int64
Sport           29216 non-null object
Discipline      29216 non-null object
Athlete         29216 non-null object
NOC             29216 non-null object
Gender          29216 non-null object
Event           29216 non-null object
Event_gender    29216 non-null object
Medal           29216 non-null object
dtypes: int64(1), object(9)
memory usage: 2.2+ MB

Using .value_counts() for ranking
pandas Series method .value_counts()
determine the top 15 countries ranked by total number of medals.
.value_counts() sorts by values by default.
The result is returned as a Series of counts indexed by unique entries from the original Series with values (counts) ranked in descending order.

In [5]:
#Select the 'NOC' column of medals: country_name
country_names= medals['NOC']
print(type(country_names))
country_names.head()

<class 'pandas.core.series.Series'>

In [6]:
country_names2= medals[['NOC']] #[[]] Double Return DataFrame
print(type(country_names2))
country_names2.head()

<class 'pandas.core.frame.DataFrame'>

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>NOC</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>HUN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>AUT</td>
    </tr>
    <tr>
      <th>2</th>
      <td>GRE</td>
    </tr>
    <tr>
      <th>3</th>
      <td>GRE</td>
    </tr>
    <tr>
      <th>4</th>
      <td>GRE</td>
    </tr>
  </tbody>
</table>
</div>

In [7]:
## Count the number of medals won by each country: medal_counts

In [8]:
medal_counts = country_names.value_counts()

In [9]:
medal_counts.head()

USA    4335
URS    2049
GBR    1594
FRA    1314
ITA    1228
Name: NOC, dtype: int64

Using .pivot_table() to count medals by typeÂ¶
Rather than ranking countries by total medals won and showing that list, you may want to see a bit more detail.
You can use a pivot table to compute how many separate bronze, silver and gold medals each country won.
That pivot table can then be used to repeat the previous computation to rank by total medals won.

In [10]:
#construct the pivot table:counted by which medal
counted = medals.pivot_table(index='NOC',columns='Medal',values='Athlete',aggfunc='count')

In [11]:
counted.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th>Medal</th>
      <th>Bronze</th>
      <th>Gold</th>
      <th>Silver</th>
    </tr>
    <tr>
      <th>NOC</th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>AFG</th>
      <td>1.0</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>AHO</th>
      <td>NaN</td>
      <td>NaN</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>ALG</th>
      <td>8.0</td>
      <td>4.0</td>
      <td>2.0</td>
    </tr>
    <tr>
      <th>ANZ</th>
      <td>5.0</td>
      <td>20.0</td>
      <td>4.0</td>
    </tr>
    <tr>
      <th>ARG</th>
      <td>88.0</td>
      <td>68.0</td>
      <td>83.0</td>
    </tr>
  </tbody>
</table>
</div>

In [12]:
## construct a new columns to see how many medals in total

In [13]:
counted['totals'] = counted.sum(axis='columns')

In [14]:
counted.head(7)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th>Medal</th>
      <th>Bronze</th>
      <th>Gold</th>
      <th>Silver</th>
      <th>totals</th>
    </tr>
    <tr>
      <th>NOC</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>AFG</th>
      <td>1.0</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>AHO</th>
      <td>NaN</td>
      <td>NaN</td>
      <td>1.0</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>ALG</th>
      <td>8.0</td>
      <td>4.0</td>
      <td>2.0</td>
      <td>14.0</td>
    </tr>
    <tr>
      <th>ANZ</th>
      <td>5.0</td>
      <td>20.0</td>
      <td>4.0</td>
      <td>29.0</td>
    </tr>
    <tr>
      <th>ARG</th>
      <td>88.0</td>
      <td>68.0</td>
      <td>83.0</td>
      <td>239.0</td>
    </tr>
    <tr>
      <th>ARM</th>
      <td>7.0</td>
      <td>1.0</td>
      <td>1.0</td>
      <td>9.0</td>
    </tr>
    <tr>
      <th>AUS</th>
      <td>413.0</td>
      <td>293.0</td>
      <td>369.0</td>
      <td>1075.0</td>
    </tr>
  </tbody>
</table>
</div>

In [15]:
## Sort the total

In [16]:
counted =counted.sort_values('totals',ascending=False)

In [17]:
counted.head(10
            )

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th>Medal</th>
      <th>Bronze</th>
      <th>Gold</th>
      <th>Silver</th>
      <th>totals</th>
    </tr>
    <tr>
      <th>NOC</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>USA</th>
      <td>1052.0</td>
      <td>2088.0</td>
      <td>1195.0</td>
      <td>4335.0</td>
    </tr>
    <tr>
      <th>URS</th>
      <td>584.0</td>
      <td>838.0</td>
      <td>627.0</td>
      <td>2049.0</td>
    </tr>
    <tr>
      <th>GBR</th>
      <td>505.0</td>
      <td>498.0</td>
      <td>591.0</td>
      <td>1594.0</td>
    </tr>
    <tr>
      <th>FRA</th>
      <td>475.0</td>
      <td>378.0</td>
      <td>461.0</td>
      <td>1314.0</td>
    </tr>
    <tr>
      <th>ITA</th>
      <td>374.0</td>
      <td>460.0</td>
      <td>394.0</td>
      <td>1228.0</td>
    </tr>
    <tr>
      <th>GER</th>
      <td>454.0</td>
      <td>407.0</td>
      <td>350.0</td>
      <td>1211.0</td>
    </tr>
    <tr>
      <th>AUS</th>
      <td>413.0</td>
      <td>293.0</td>
      <td>369.0</td>
      <td>1075.0</td>
    </tr>
    <tr>
      <th>HUN</th>
      <td>345.0</td>
      <td>400.0</td>
      <td>308.0</td>
      <td>1053.0</td>
    </tr>
    <tr>
      <th>SWE</th>
      <td>325.0</td>
      <td>347.0</td>
      <td>349.0</td>
      <td>1021.0</td>
    </tr>
    <tr>
      <th>GDR</th>
      <td>225.0</td>
      <td>329.0</td>
      <td>271.0</td>
      <td>825.0</td>
    </tr>
  </tbody>
</table>
</div>

### Applying .drop_duplicates()
 - What could be the difference between the 'Event_gender' and 'Gender' columns?
 - you should be able to evaluate your guess by looking at the unique values of the pairs (Event_gender, Gender)
 - The duplicates can be dropped using the .drop_duplicates() method, leaving behind the unique observations.

In [18]:
ev_gen = medals[['Event_gender','Gender']]

In [19]:
ev_gen.shape

(29216, 2)

In [20]:
ev_gen.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Event_gender</th>
      <th>Gender</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>M</td>
      <td>Men</td>
    </tr>
    <tr>
      <th>1</th>
      <td>M</td>
      <td>Men</td>
    </tr>
    <tr>
      <th>2</th>
      <td>M</td>
      <td>Men</td>
    </tr>
    <tr>
      <th>3</th>
      <td>M</td>
      <td>Men</td>
    </tr>
    <tr>
      <th>4</th>
      <td>M</td>
      <td>Men</td>
    </tr>
  </tbody>
</table>
</div>

In [21]:
#drop duplicate pairs:

In [22]:
ev_gen_uniques= ev_gen.drop_duplicates()

In [23]:
ev_gen_uniques

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Event_gender</th>
      <th>Gender</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>M</td>
      <td>Men</td>
    </tr>
    <tr>
      <th>348</th>
      <td>X</td>
      <td>Men</td>
    </tr>
    <tr>
      <th>416</th>
      <td>W</td>
      <td>Women</td>
    </tr>
    <tr>
      <th>639</th>
      <td>X</td>
      <td>Women</td>
    </tr>
    <tr>
      <th>23675</th>
      <td>W</td>
      <td>Men</td>
    </tr>
  </tbody>
</table>
</div>

### Finding possible errors with .groupby()

 - You can use groupby to see to count the rows
 - You will see that there is only one suspicious row, this is likely a data error

In [24]:
medals_by_gender = medals.groupby(['Event_gender','Gender'])

In [25]:
medals_count_by_gender = medals_by_gender.count()

In [26]:
medals_count_by_gender

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>City</th>
      <th>Edition</th>
      <th>Sport</th>
      <th>Discipline</th>
      <th>Athlete</th>
      <th>NOC</th>
      <th>Event</th>
      <th>Medal</th>
    </tr>
    <tr>
      <th>Event_gender</th>
      <th>Gender</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>M</th>
      <th>Men</th>
      <td>20067</td>
      <td>20067</td>
      <td>20067</td>
      <td>20067</td>
      <td>20067</td>
      <td>20067</td>
      <td>20067</td>
      <td>20067</td>
    </tr>
    <tr>
      <th rowspan="2" valign="top">W</th>
      <th>Men</th>
      <td>1</td>
      <td>1</td>
      <td>1</td>
      <td>1</td>
      <td>1</td>
      <td>1</td>
      <td>1</td>
      <td>1</td>
    </tr>
    <tr>
      <th>Women</th>
      <td>7277</td>
      <td>7277</td>
      <td>7277</td>
      <td>7277</td>
      <td>7277</td>
      <td>7277</td>
      <td>7277</td>
      <td>7277</td>
    </tr>
    <tr>
      <th rowspan="2" valign="top">X</th>
      <th>Men</th>
      <td>1653</td>
      <td>1653</td>
      <td>1653</td>
      <td>1653</td>
      <td>1653</td>
      <td>1653</td>
      <td>1653</td>
      <td>1653</td>
    </tr>
    <tr>
      <th>Women</th>
      <td>218</td>
      <td>218</td>
      <td>218</td>
      <td>218</td>
      <td>218</td>
      <td>218</td>
      <td>218</td>
      <td>218</td>
    </tr>
  </tbody>
</table>
</div>

In [27]:
# Find which row is the error

In [28]:
#Create the boolean Series
sus = (medals.Event_gender == 'W') & (medals.Gender == 'Men')
sus.head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [29]:
suspect = medals[sus]
suspect

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>City</th>
      <th>Edition</th>
      <th>Sport</th>
      <th>Discipline</th>
      <th>Athlete</th>
      <th>NOC</th>
      <th>Gender</th>
      <th>Event</th>
      <th>Event_gender</th>
      <th>Medal</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>23675</th>
      <td>Sydney</td>
      <td>2000</td>
      <td>Athletics</td>
      <td>Athletics</td>
      <td>CHEPCHUMBA, Joyce</td>
      <td>KEN</td>
      <td>Men</td>
      <td>marathon</td>
      <td>W</td>
      <td>Bronze</td>
    </tr>
  </tbody>
</table>
</div>

In [30]:
## Constructing alternative country Ranking

In [31]:
### Counting distinct events

In [32]:
print(len(medals['Sport'].unique()))

42

In [33]:
medals['Sport'].unique()

array(['Aquatics', 'Athletics', 'Cycling', 'Fencing', 'Gymnastics',
       'Shooting', 'Tennis', 'Weightlifting', 'Wrestling', 'Archery',
       'Basque Pelota', 'Cricket', 'Croquet', 'Equestrian', 'Football',
       'Golf', 'Polo', 'Rowing', 'Rugby', 'Sailing', 'Tug of War',
       'Boxing', 'Lacrosse', 'Roque', 'Hockey', 'Jeu de paume', 'Rackets',
       'Skating', 'Water Motorsports', 'Modern Pentathlon', 'Ice Hockey',
       'Basketball', 'Canoe / Kayak', 'Handball', 'Judo', 'Volleyball',
       'Table Tennis', 'Badminton', 'Baseball', 'Softball', 'Taekwondo',
       'Triathlon'], dtype=object)

In [34]:
#Group medas by 'NOC'

In [35]:
country_grouped= medals.groupby('NOC')

In [36]:
# Count the number of distinct sprots in which each country won

In [37]:
Nsports = country_grouped['Sport'].nunique()

In [38]:
Nsports.sort_values(ascending=False).head()

NOC
USA    34
GBR    31
FRA    28
GER    26
CHN    24
Name: Sport, dtype: int64

In [39]:
country_grouped['Sport'].count().head()

NOC
AFG      1
AHO      1
ALG     14
ANZ     29
ARG    239
Name: Sport, dtype: int64

## Counting USA vs. USSR Cold War Olympic Sports
 - The Olympic competitions between 1952 and 1988 took place during the height of the Cold War between the United States of America (USA) & the Union of Soviet Socialist Republics (USSR).
 - Your goal in this exercise is to aggregate the number of distinct sports in which the USA and the USSR won medals during the Cold War years.

In [40]:
# Extract all rows for which the 'Edition' is between 1952 & 1988: during_cold_war

In [41]:
during_cold_war = (medals.Edition>= 1952) & (medals.Edition<=1988)

In [42]:
print(during_cold_war.value_counts())

False    17637
True     11579
Name: Edition, dtype: int64

In [43]:
during_cold_war.head()

0    False
1    False
2    False
3    False
4    False
Name: Edition, dtype: bool

In [44]:
#Extract rows for 'NOC' is in 'USA' and 'USR
is_usa_usr = medals.NOC.isin(['USA','URS'])
print(is_usa_usr.value_counts())

False    22832
True      6384
Name: NOC, dtype: int64

In [45]:
is_usa_usr.head()

0    False
1    False
2    False
3    False
4    False
Name: NOC, dtype: bool